{
  "author": "Jonee",
  "ua": "Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1",
  "homeUrl": "https://auete.com",
  "cateManual": {
    "电影": "1",
    "电视剧": "2",
    "综艺": "3",
    "动漫": "4"
  },
  	"author":"Jonee",
  "homeVodNode": "//div[contains(@class,'picture_list_container')]/ul/li",
  "homeVodName": "/a/img/@title",
  "homeVodId": "/h2/a/@href",
  "homeVodImg": "/a/img/@src",
  "homeVodMark": "/a/button/text()",
  "cateUrl": "https://auete.com/search.php?page={catePg}&searchtype=5&order={by}&tid={cateId}&jq={class}&area={area}&year={year}",
  "cateVodNode": "//div[contains(@class,'picture_list_container')]/ul/li",
  "cateVodName": "/a/img/@title",
  "cateVodId": "/h2/a/@href",
  "cateVodImg": "/a/img/@src",
  "cateVodMark": "/a/button/text()",
  "dtUrl": "https://auete.com/{vid}",
  "dtNode": "//div[@class='card-body']",
  "dtName": "//h1[contains(@class,'title break-all')]/text()",
  "dtImg": "//div[@class='cover']/a/@href",
  "dtCate": "//div[@class='message break-all']/p[8]/text()",
  "dtArea": "//div[@class='message break-all']/p[10]/text()",
  "dtYear": "//div[@class='message break-all']/p[11]/text()",
  "dtActor": "//div[@class='message break-all']/p[7]/text()",
  "dtDirector": "//div[@class='message break-all']/p[5]/text()",
  "dtMark": "//div[@class='message break-all']/p[14]/text()",
  "dtDesc": "//div[@class='message break-all']/p[16]/text()",
  "dtFromNode": "//div[contains(@id,'player_list')]/h2",
  "dtFromName": "[substring-after(text(),'播')]", 
  "dtUrlNode": "//div[contains(@id,'player_list')]/ul",
  "dtUrlSubNode": "/li/a",
  "dtUrlId": "/@href",
  "dtUrlName": "/text()",
  "playUrl": "https://auete.com/{playUrl}",
  "playUa": "",
  "searchUrl": "https://auete.com/search.php?searchword={wd}",
  "scVodNode": "//ul[contains(@class,'list-unstyled threadlist')]/li/div/div[1]/a",
  "scVodName": "/span/text()",
  "scVodId": "/@href",
  "scVodIdR": "",
  "scVodImg": "pic",
  

"filter":{
"1": [
{"name":"分类","key":"cateId","value":[{"n":"全部","v":"1"},{"n":"喜剧片","v":"5"},{"n":"动作片","v":"6"},{"n":"爱情片","v":"7"},{"n":"科幻片","v":"8"},{"n":"恐怖片","v":"9"},{"n":"惊悚片","v":"10"},{"n":"战争片","v":"11"},{"n":"剧情片","v":"12"},{"n":"记录片","v":"25"},{"n":"经典片","v":"26"},{"n":"网大电影","v":"28"},{"n":"国产老电影","v":"45"}]},
{"name":"年份","key":"year","value":[{"n":"全部","v":""},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"more","v":"more"}]},
{"name":"剧情","key":"class","value":[{"n":"全部","v":""},{"n":"Netflix","v":"Netflix"},{"n":"Top250","v":"Top250"},{"n":"惊悚","v":"惊悚"},{"n":"悬疑","v":"悬疑"},{"n":"奇幻","v":"奇幻"},{"n":"漫改","v":"漫改"},{"n":"灾难","v":"灾难"},{"n":"犯罪","v":"犯罪"},{"n":"文艺","v":"文艺"},{"n":"西部","v":"西部"},{"n":"丧尸","v":"丧尸"},{"n":"传记","v":"传记"},{"n":"经典","v":"经典"},{"n":"历史","v":"历史"},{"n":"音乐","v":"音乐"},{"n":"穿越","v":"穿越"},{"n":"武侠","v":"武侠"},{"n":"歌舞","v":"歌舞"},{"n":"hbo","v":"hbo"},{"n":"古装","v":"古装"},{"n":"名著","v":"名著"},{"n":"ViuTV","v":"ViuTV"},{"n":"同性","v":"同性"},{"n":"运动","v":"运动"},{"n":"邵氏","v":"邵氏"},{"n":"战争","v":"战争"},{"n":"短片","v":"短片"},{"n":"儿童","v":"儿童"},{"n":"恐怖","v":"恐怖"},{"n":"二次元","v":"二次元"},{"n":"商战","v":"商战"},{"n":"军旅","v":"军旅"},{"n":"戏曲","v":"戏曲"}]},
{"name":"地区","key":"area","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},
{"name":"排序","key":"by","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hit"},{"n":"推荐","v":"commend"}]}
],
"2": [
{"name":"分类","key":"cateId","value":[{"n":"全部","v":"2"},{"n":"国产","v":"23"},{"n":"美剧","v":"13"},{"n":"韩剧","v":"14"},{"n":"日剧","v":"15"},{"n":"泰剧","v":"16"},{"n":"网剧","v":"17"},{"n":"台剧","v":"18"},{"n":"港剧","v":"29"},{"n":"英剧","v":"52"},{"n":"经典剧","v":"27"}]},
{"name":"年份","key":"year","value":[{"n":"全部","v":""},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"more","v":"more"}]},
{"name":"剧情","key":"class","value":[{"n":"全部","v":""},{"n":"Netflix","v":"Netflix"},{"n":"Top250","v":"Top250"},{"n":"惊悚","v":"惊悚"},{"n":"悬疑","v":"悬疑"},{"n":"奇幻","v":"奇幻"},{"n":"漫改","v":"漫改"},{"n":"灾难","v":"灾难"},{"n":"犯罪","v":"犯罪"},{"n":"文艺","v":"文艺"},{"n":"西部","v":"西部"},{"n":"丧尸","v":"丧尸"},{"n":"传记","v":"传记"},{"n":"经典","v":"经典"},{"n":"历史","v":"历史"},{"n":"音乐","v":"音乐"},{"n":"穿越","v":"穿越"},{"n":"武侠","v":"武侠"},{"n":"歌舞","v":"歌舞"},{"n":"hbo","v":"hbo"},{"n":"古装","v":"古装"},{"n":"名著","v":"名著"},{"n":"ViuTV","v":"ViuTV"},{"n":"同性","v":"同性"},{"n":"运动","v":"运动"},{"n":"邵氏","v":"邵氏"},{"n":"战争","v":"战争"},{"n":"短片","v":"短片"},{"n":"儿童","v":"儿童"},{"n":"恐怖","v":"恐怖"},{"n":"二次元","v":"二次元"},{"n":"商战","v":"商战"},{"n":"军旅","v":"军旅"},{"n":"戏曲","v":"戏曲"}]},
{"name":"地区","key":"area","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},
{"name":"排序","key":"by","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hit"},{"n":"推荐","v":"commend"}]}
],
"3": [
{"name":"分类","key":"cateId","value":[{"n":"全部","v":"3"},{"n":"国综","v":"47"},{"n":"韩综","v":"48"},{"n":"美综","v":"51"}]},
{"name":"年份","key":"year","value":[{"n":"全部","v":""},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"more","v":"more"}]},
{"name":"剧情","key":"class","value":[{"n":"全部","v":""},{"n":"Netflix","v":"Netflix"},{"n":"Top250","v":"Top250"},{"n":"惊悚","v":"惊悚"},{"n":"悬疑","v":"悬疑"},{"n":"奇幻","v":"奇幻"},{"n":"漫改","v":"漫改"},{"n":"灾难","v":"灾难"},{"n":"犯罪","v":"犯罪"},{"n":"文艺","v":"文艺"},{"n":"西部","v":"西部"},{"n":"丧尸","v":"丧尸"},{"n":"传记","v":"传记"},{"n":"经典","v":"经典"},{"n":"历史","v":"历史"},{"n":"音乐","v":"音乐"},{"n":"穿越","v":"穿越"},{"n":"武侠","v":"武侠"},{"n":"歌舞","v":"歌舞"},{"n":"hbo","v":"hbo"},{"n":"古装","v":"古装"},{"n":"名著","v":"名著"},{"n":"ViuTV","v":"ViuTV"},{"n":"同性","v":"同性"},{"n":"运动","v":"运动"},{"n":"邵氏","v":"邵氏"},{"n":"战争","v":"战争"},{"n":"短片","v":"短片"},{"n":"儿童","v":"儿童"},{"n":"恐怖","v":"恐怖"},{"n":"二次元","v":"二次元"},{"n":"商战","v":"商战"},{"n":"军旅","v":"军旅"},{"n":"戏曲","v":"戏曲"}]},
{"name":"地区","key":"area","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},
{"name":"排序","key":"by","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hit"},{"n":"推荐","v":"commend"}]}
],
"4": [
{"name":"分类","key":"cateId","value":[{"n":"全部","v":"4"},{"n":"动画","v":"19"},{"n":"日漫","v":"20"},{"n":"国漫","v":"21"},{"n":"美漫","v":"22"}]},
{"name":"年份","key":"year","value":[{"n":"全部","v":""},{"n":"2022","v":"2022"},{"n":"2021","v":"2021"},{"n":"2020","v":"2020"},{"n":"2019","v":"2019"},{"n":"2018","v":"2018"},{"n":"2017","v":"2017"},{"n":"2016","v":"2016"},{"n":"2015","v":"2015"},{"n":"2014","v":"2014"},{"n":"2013","v":"2013"},{"n":"2012","v":"2012"},{"n":"2011","v":"2011"},{"n":"more","v":"more"}]},
{"name":"剧情","key":"class","value":[{"n":"全部","v":""},{"n":"Netflix","v":"Netflix"},{"n":"Top250","v":"Top250"},{"n":"惊悚","v":"惊悚"},{"n":"悬疑","v":"悬疑"},{"n":"奇幻","v":"奇幻"},{"n":"漫改","v":"漫改"},{"n":"灾难","v":"灾难"},{"n":"犯罪","v":"犯罪"},{"n":"文艺","v":"文艺"},{"n":"西部","v":"西部"},{"n":"丧尸","v":"丧尸"},{"n":"传记","v":"传记"},{"n":"经典","v":"经典"},{"n":"历史","v":"历史"},{"n":"音乐","v":"音乐"},{"n":"穿越","v":"穿越"},{"n":"武侠","v":"武侠"},{"n":"歌舞","v":"歌舞"},{"n":"hbo","v":"hbo"},{"n":"古装","v":"古装"},{"n":"名著","v":"名著"},{"n":"ViuTV","v":"ViuTV"},{"n":"同性","v":"同性"},{"n":"运动","v":"运动"},{"n":"邵氏","v":"邵氏"},{"n":"战争","v":"战争"},{"n":"短片","v":"短片"},{"n":"儿童","v":"儿童"},{"n":"恐怖","v":"恐怖"},{"n":"二次元","v":"二次元"},{"n":"商战","v":"商战"},{"n":"军旅","v":"军旅"},{"n":"戏曲","v":"戏曲"}]},
{"name":"地区","key":"area","value":[{"n":"全部","v":""},{"n":"大陆","v":"大陆"},{"n":"香港","v":"香港"},{"n":"台湾","v":"台湾"},{"n":"日本","v":"日本"},{"n":"韩国","v":"韩国"},{"n":"欧美","v":"欧美"},{"n":"泰国","v":"泰国"},{"n":"其他","v":"其他"}]},
{"name":"排序","key":"by","value":[{"n":"时间","v":"time"},{"n":"人气","v":"hit"},{"n":"推荐","v":"commend"}]}
]
}
}
